app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
    def index
        cats = Cat.all

INSERT INTO "cats" ("name", "age", "enjoys", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "hi"], ["age", 0], ["enjoys", "hi"], ["created_at", "2020-06-19 18:21:45.554964"], ["updated_at", "2020-06-19 18:21:45.554964"]]
---
    def create
        # Create a new cat
        cat = Cat.create(cat_params)

INSERT INTO "cats" ("name", "age", "enjoys", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "hi"], ["age", 0], ["enjoys", "hi"], ["created_at", "2020-06-19 18:21:45.554964"], ["updated_at", "2020-06-19 18:21:45.554964"]]
---
    def create
        cat = Cat.create(cat_params)